Revit 2027 API
BoundaryConditionsType Enumeration
 This enum declares type of BoundaryConditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BoundaryConditionsType
Public Enumeration BoundaryConditionsType
public enum class BoundaryConditionsType
type BoundaryConditionsType
Members
Member name | Value | Description
Area | 2 |  Area Boundary Conditions
Line | 1 |  Line Boundary Conditions
Point | 0 |  Point Boundary Conditions
See Also
Reference
Autodesk.Revit.DB.Structure Namespace